# Tiny Shop Exercise

## Introduction

Let's get started!

The case study is [here](https://d-i-motion.com/lessons/customer-orders-analysis/), and the task is the following:

We have a Tiny Shop database with the following tables:
1. customers
2. products
3. orders
4. order_items

Using our SQL skills, we need to answer the following questions:

1. Which product has the highest price? Only return a single row.
2. Which customer has made the most orders?
3. What’s the total revenue per product?
4. Find the day with the highest revenue.
5. Find the first order (by date) for each customer.
6. Find the top 3 customers who have ordered the most distinct products
7. Which product has been bought the least in terms of quantity?
8. What is the median order total?
9. For each order, determine if it was ‘Expensive’ (total over 300), ‘Affordable’ (total over 100), or ‘Cheap’.
10. Find customers who have ordered the product with the highest price.

## Connecting to the database

First of all, we're gonna have to connect to our PostgreSQL database called `tinyshop`. It has already been created, but there are no tables or data in it. Let's first get some technical stuff out of the way.

The following code retrieves my PostgreSQL connection credentials (username and password):

In [2]:
import dotenv
dotenv.load_dotenv()
import os

The following code establishes my connection to the PostgreSQL database. It uses `ipython-sql`, `sqlalchemy` and `psycopg2` packages:

In [3]:
%load_ext sql
%sql postgresql://{os.getenv('DB_USERNAME')}:{os.getenv('DB_PASSWORD')}@localhost/tinyshop

'Connected: marekmica@tinyshop'

## Loading data into our database:
Now that we are connected to `tinyshop`, we can create our tables and fill them with data:

In [4]:
%%sql -- This is a cell magic command. Using it will treat the entire cell as an SQL query.

-- Notice that I need to use SQL syntax and so I use "--" to write comments in this cell.

CREATE TABLE customers (
    customer_id integer PRIMARY KEY,
    first_name varchar(100),
    last_name varchar(100),
    email varchar(100)
);

CREATE TABLE products (
    product_id integer PRIMARY KEY,
    product_name varchar(100),
    price decimal
);

CREATE TABLE orders (
    order_id integer PRIMARY KEY,
    customer_id integer,
    order_date date
);

CREATE TABLE order_items (
    order_id integer,
    product_id integer,
    quantity integer
);

 * postgresql://marekmica:***@localhost/tinyshop
Done.
Done.
Done.
Done.

[]

In [5]:
%%sql

-- These queries insert data into our tables:

INSERT INTO customers (customer_id, first_name, last_name, email) VALUES
(1, 'John', 'Doe', 'johndoe@email.com'),
(2, 'Jane', 'Smith', 'janesmith@email.com'),
(3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
(4, 'Alice', 'Brown', 'alicebrown@email.com'),
(5, 'Charlie', 'Davis', 'charliedavis@email.com'),
(6, 'Eva', 'Fisher', 'evafisher@email.com'),
(7, 'George', 'Harris', 'georgeharris@email.com'),
(8, 'Ivy', 'Jones', 'ivyjones@email.com'),
(9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
(10, 'Lily', 'Nelson', 'lilynelson@email.com'),
(11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
(12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
(13, 'Sophia', 'Thomas', 'sophiathomas@email.com');

INSERT INTO products (product_id, product_name, price) VALUES
(1, 'Product A', 10.00),
(2, 'Product B', 15.00),
(3, 'Product C', 20.00),
(4, 'Product D', 25.00),
(5, 'Product E', 30.00),
(6, 'Product F', 35.00),
(7, 'Product G', 40.00),
(8, 'Product H', 45.00),
(9, 'Product I', 50.00),
(10, 'Product J', 55.00),
(11, 'Product K', 60.00),
(12, 'Product L', 65.00),
(13, 'Product M', 70.00);

INSERT INTO orders (order_id, customer_id, order_date) VALUES
(1, 1, '2023-05-01'),
(2, 2, '2023-05-02'),
(3, 3, '2023-05-03'),
(4, 1, '2023-05-04'),
(5, 2, '2023-05-05'),
(6, 3, '2023-05-06'),
(7, 4, '2023-05-07'),
(8, 5, '2023-05-08'),
(9, 6, '2023-05-09'),
(10, 7, '2023-05-10'),
(11, 8, '2023-05-11'),
(12, 9, '2023-05-12'),
(13, 10, '2023-05-13'),
(14, 11, '2023-05-14'),
(15, 12, '2023-05-15'),
(16, 13, '2023-05-16');

INSERT INTO order_items (order_id, product_id, quantity) VALUES
(1, 1, 2),
(1, 2, 1),
(2, 2, 1),
(2, 3, 3),
(3, 1, 1),
(3, 3, 2),
(4, 2, 4),
(4, 3, 1),
(5, 1, 1),
(5, 3, 2),
(6, 2, 3),
(6, 1, 1),
(7, 4, 1),
(7, 5, 2),
(8, 6, 3),
(8, 7, 1),
(9, 8, 2),
(9, 9, 1),
(10, 10, 3),
(10, 11, 2),
(11, 12, 1),
(11, 13, 3),
(12, 4, 2),
(12, 5, 1),
(13, 6, 3),
(13, 7, 2),
(14, 8, 1),
(14, 9, 2),
(15, 10, 3),
(15, 11, 1),
(16, 12, 2),
(16, 13, 3);

 * postgresql://marekmica:***@localhost/tinyshop
13 rows affected.
13 rows affected.
16 rows affected.
32 rows affected.

[]

## Answering the questions:
### 1. Which product has the highest price? Only return a single row.

In [6]:
%%sql

SELECT * FROM products ORDER BY price DESC LIMIT 1;

 * postgresql://marekmica:***@localhost/tinyshop
1 rows affected.

[(13, 'Product M', Decimal('70.00'))]

### 2. Which customer has made the most orders?

In [7]:
%%sql

SELECT
    COUNT(*),
    customer_id
FROM
    orders
GROUP BY
    customer_id
ORDER BY
    COUNT(order_id) DESC

 * postgresql://marekmica:***@localhost/tinyshop
13 rows affected.

[(2, 2),
 (2, 1),
 (2, 3),
 (1, 4),
 (1, 10),
 (1, 6),
 (1, 13),
 (1, 7),
 (1, 12),
 (1, 11),
 (1, 8),
 (1, 9),
 (1, 5)]

### 3. What’s the total revenue per product?

price * quantity is total_revenue, and we need to sum it up by product_id

In [8]:
%%sql

SELECT
    products.product_id,
    SUM(price * quantity) AS total_revenue
FROM orders
JOIN order_items
    ON order_items.order_id = orders.order_id
JOIN products
    ON order_items.product_id = products.product_id
GROUP BY products.product_id;

 * postgresql://marekmica:***@localhost/tinyshop
13 rows affected.

[(5, Decimal('90.00')),
 (4, Decimal('75.00')),
 (10, Decimal('330.00')),
 (6, Decimal('210.00')),
 (13, Decimal('420.00')),
 (2, Decimal('135.00')),
 (7, Decimal('120.00')),
 (1, Decimal('50.00')),
 (8, Decimal('135.00')),
 (11, Decimal('180.00')),
 (9, Decimal('150.00')),
 (3, Decimal('160.00')),
 (12, Decimal('195.00'))]

### 4. Find the day with the highest revenue.

-- price * quantity is revenue, and we need to sum it up by order_date

In [9]:
%%sql

SELECT
    orders.order_date,
    SUM(price * quantity) AS total_revenue
FROM orders
JOIN order_items
    ON order_items.order_id = orders.order_id
JOIN products
    ON order_items.product_id = products.product_id
GROUP BY orders.order_date
ORDER BY total_revenue DESC
LIMIT 1;

 * postgresql://marekmica:***@localhost/tinyshop
1 rows affected.

[(datetime.date(2023, 5, 16), Decimal('340.00'))]

### 5. Find the first order (by date) for each customer.

In [10]:
%%sql

WITH orders_numbered AS (
    SELECT
        customers.customer_id,
        order_date,
        ROW_NUMBER() OVER(
            PARTITION BY customers.customer_id
            ORDER BY order_date
        ) AS order_number
    FROM customers
    JOIN orders
        ON customers.customer_id = orders.customer_id
)

SELECT * FROM orders_numbered
WHERE order_number = 1;

 * postgresql://marekmica:***@localhost/tinyshop
13 rows affected.

[(1, datetime.date(2023, 5, 1), 1),
 (2, datetime.date(2023, 5, 2), 1),
 (3, datetime.date(2023, 5, 3), 1),
 (4, datetime.date(2023, 5, 7), 1),
 (5, datetime.date(2023, 5, 8), 1),
 (6, datetime.date(2023, 5, 9), 1),
 (7, datetime.date(2023, 5, 10), 1),
 (8, datetime.date(2023, 5, 11), 1),
 (9, datetime.date(2023, 5, 12), 1),
 (10, datetime.date(2023, 5, 13), 1),
 (11, datetime.date(2023, 5, 14), 1),
 (12, datetime.date(2023, 5, 15), 1),
 (13, datetime.date(2023, 5, 16), 1)]

### 6. Find the top 3 customers who have ordered the most distinct products

In [11]:
%%sql

SELECT orders.customer_id, COUNT(DISTINCT products.product_id) -- counts the distinct product_ids for each customer_id
FROM orders
JOIN order_items
    ON order_items.order_id = orders.order_id
JOIN products
    ON order_items.product_id = products.product_id
GROUP BY orders.customer_id;

 * postgresql://marekmica:***@localhost/tinyshop
13 rows affected.

[(1, 3),
 (2, 3),
 (3, 3),
 (4, 2),
 (5, 2),
 (6, 2),
 (7, 2),
 (8, 2),
 (9, 2),
 (10, 2),
 (11, 2),
 (12, 2),
 (13, 2)]

### 7. Which product has been bought the least in terms of quantity?

In [16]:
%%sql

WITH product_counts AS (
    SELECT
        product_id,
        COUNT(product_id) AS total_quantity
    FROM order_items
    GROUP BY product_id
)

SELECT *
FROM product_counts
WHERE total_quantity = (
    SELECT MAX(total_quantity)
    FROM product_counts
);

 * postgresql://marekmica:***@localhost/tinyshop
3 rows affected.

[(3, 4), (2, 4), (1, 4)]

### 8. What is the median order total?

In [13]:
%%sql

WITH revenue AS (
    SELECT orders.order_id, SUM(price * quantity) AS revenue_per_order
    FROM orders
    JOIN order_items
        ON order_items.order_id = orders.order_id
    JOIN products
        ON order_items.product_id = products.product_id
    GROUP BY orders.order_id
)

SELECT
percentile_cont(0.5) WITHIN GROUP (ORDER BY revenue_per_order) AS median_order_total
FROM revenue;

 * postgresql://marekmica:***@localhost/tinyshop
1 rows affected.

[(112.5,)]

### 9. For each order, determine if it was ‘Expensive’ (total over 300), ‘Affordable’ (total over 100), or ‘Cheap’.

In [14]:
%%sql

SELECT
    orders.order_id, 
    SUM(price * quantity) AS revenue_per_order,
    CASE
        WHEN SUM(price * quantity) > 300 THEN 'Expensive'
        WHEN SUM(price * quantity) > 100 THEN 'Affordable'
        ELSE 'Cheap'
    END AS category
FROM orders
JOIN order_items
    ON order_items.order_id = orders.order_id
JOIN products
    ON order_items.product_id = products.product_id
GROUP BY orders.order_id
ORDER BY order_id;

 * postgresql://marekmica:***@localhost/tinyshop
16 rows affected.

[(1, Decimal('35.00'), 'Cheap'),
 (2, Decimal('75.00'), 'Cheap'),
 (3, Decimal('50.00'), 'Cheap'),
 (4, Decimal('80.00'), 'Cheap'),
 (5, Decimal('50.00'), 'Cheap'),
 (6, Decimal('55.00'), 'Cheap'),
 (7, Decimal('85.00'), 'Cheap'),
 (8, Decimal('145.00'), 'Affordable'),
 (9, Decimal('140.00'), 'Affordable'),
 (10, Decimal('285.00'), 'Affordable'),
 (11, Decimal('275.00'), 'Affordable'),
 (12, Decimal('80.00'), 'Cheap'),
 (13, Decimal('185.00'), 'Affordable'),
 (14, Decimal('145.00'), 'Affordable'),
 (15, Decimal('225.00'), 'Affordable'),
 (16, Decimal('340.00'), 'Expensive')]

### 10. Find customers who have ordered the product with the highest price.

In [15]:
%%sql

SELECT orders.customer_id
FROM orders
JOIN order_items
    ON order_items.order_id = orders.order_id
JOIN products
    ON order_items.product_id = products.product_id
WHERE order_items.product_id IN (
    SELECT product_id
    FROM products
    ORDER BY price DESC
    LIMIT 1
);

 * postgresql://marekmica:***@localhost/tinyshop
2 rows affected.

[(8,), (13,)]